# GetAllStructuralConnectionApprovalTypes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionApprovalType..::..GetAllStructuralConnectionApprovalTypes Method
StructuralConnectionApprovalType Class See Also
---
Collects the ids of all StructuralConnectionApprovalTypes in the document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static void GetAllStructuralConnectionApprovalTypes(
	Document cda,
	out ICollection<ElementId> ids
)
```

Visual Basic
---
```text
Public Shared Sub GetAllStructuralConnectionApprovalTypes ( _
	cda As Document, _
	<OutAttribute> ByRef ids As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
static void GetAllStructuralConnectionApprovalTypes(
	Document^ cda,
	[OutAttribute] ICollection<ElementId^>^% ids
)
```

# ### Parameters
cda
    Type: Autodesk.Revit.DB..::..Document
ids
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)>%
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace